// app/constants/messageTemplate.ts

export const MESSAGE_TEMPLATE = `
안녕하세요!
:) 이번 주 본식 DVD 촬영 진행하게 된 영상 작가입니다.
촬영 전 최종 확인차 연락드렸구요!
본식 관련 요청사항 및 특이사항 있으면 저에게 연락 주시면 됩니다^^
촬영 준비 잘해서 당일 인사드리겠습니다!

본식시간: {{weddingDateTime}}
촬영시작: {{shootTime}}
본식장소: {{location}}
고객명: {{customerName}}
진행순서: 신부대기실-본식-원판{{hasReception}}{{hasSecondPart}}

확인 후 회신 부탁드립니다!☺
———
촬영 관련 꿀tip!

#대기실
-신부님 셀카 찍으실 때 어떤 쪽을 선호하시는지 얘기해주세요! 다양하게 촬영하지만 신부님 원하는 각도 위주로 촬영해 드릴 수 있습니다😊

#본식
-입장 시 (특히 신랑님) 긴장을 많이 하시기에 빠른 걸음으로 입장하시는데 최대한 천천히 웃으며 걸어오시는 게 좋구요
인사는 확실하게 해 주셔야 사진도 영상도 멋있게 촬영해 드릴 수 있어요!

-신부님은 입장 시 드레스가 무겁고 발에 걸릴까 불안하셔서 아래를 보시는데 그럼 얼굴이 잘 보이지 않으니, 신랑님을 보시면서 환한 미소와 함께 들어오시는 걸 추천드립니다☺

-혼인 서약 시 혼인서약 판은 얼굴이 가려지지 않도록 내려서 읽어주세요!

-예물 교환은 최~대한 천천히 진행해 주셔야 해요 7초 이상은 담겨야 하기에 너무 빨리 반지를 끼우면 편집하기 어려울 수 있습니다!

-덕담 및 주례 시 미소와 함께 정면을 바라보시는 게 제일 좋구요
혹시 얼굴 보는 게 부담스러우시면
덕담자의 귀 또는 인중을 바라봐 주시면 됩니다!
(아래쪽을 쳐다보게 되면 결과물 받아보시고 아쉬워하실 수 있어요😟 )

-축가 및 축사 시 신랑님과 자주 마주 보고
웃으며 대화 한마디씩 나눠주세요!
더 다양한 장면과 자연스러운 영상이 담깁니다!

-아 신랑님~혹시 '깜짝 이벤트'
준비하셨다면 저에게는 꼭꼭 말씀해 주셔야 합니다!! 꼭이요!!😊😊😊
요정도 확인해 주시고 오시면 좋을 것 같아요

촬영 날에 뵙겠습니다!😊

그리고 추가로 식순 및 대본이 있으시면 받아볼 수 있을까요?
`.trim();
